<template>
  <div class="md:px-[78px] px-6">
    <div class="">Приветствую. На верстку потратил около 5 часов. Час в пятницу вечером, ознакомиться и продумать. Плюс шапка.
        Остальное в субботу, два часа с утра и два после обеда. Использовал TAilwind. Смотрел классы на их сайте если не помнил.
    </div>
    <div class="">По первому заданию сложнее в том плане что так до конца и не понял что нужно сделать. Как итог сделал разворачивающееся
        дерево, которое плюс разворачивается на локальных уровнях, плюс при нажатии на чекбоксы counts добавляються/убираються в TOTAL COUNT. 
        На него времени потратил минут 40-50. Но это не считая времени которое потратил на то чтобы понять то что в итоге так и не сделал. Использовал
        Pinia. Само тз сделано на Nuxt, выложено на Vercel.  
    </div>
  </div>
</template>

<script lang="ts" setup>

</script>

<style>

</style>